ApacheDll/StressTest/Textdokument (neu).txt
CPU 17% bis 25%
Speicher 37 %



D:\Delphi\Appachetest\StressTest>C:\DataHub\apache\bin\ab -n 100000 -c 20 -p body.json -T "application/json" -H "Authorization: Bearer eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpc3MiOiJJbnRlcmJhc2Utd2VibW9kdWxlIiwic3ViIjoiTVciLCJpYXQiOjE3NjI0NTQ4NTQsImV4cCI6MTc2Mjg4Njg1NCwicm9sZSI6IntcIkxPR0lOTkFNRVwiOlwiTVdcIixcIlVTRVJOQU1FXCI6XCJNYXJjIFdhbGtlclwiLFwiUEFTU1dPUlRcIjpcIlwiLFwiR1JVUFBFXCI6XCJcIixcIlpVR1JVUFBFXCI6XCJcIixcIkFHRU5UVVJDT0RFXCI6XCIxPTFcIixcIktFTk5aSUZGRVJcIjpcIjEwMjAxXCIsXCJGSUxJQUxFXCI6XCJcIixcIkFCVEVJTFVOR1wiOlwiXCJ9In0.2W8kEN_nIODILJTD58FP7dwFap1yd5ZQdwwG2ah2SWI" http://localhost/ibapi/select
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 10000 requests
Completed 20000 requests
Completed 30000 requests
Completed 40000 requests
Completed 50000 requests
Completed 60000 requests
Completed 70000 requests
Completed 80000 requests
Completed 90000 requests
Completed 100000 requests
Finished 100000 requests


Server Software:        Apache/2.4.53
Server Hostname:        localhost
Server Port:            80

Document Path:          /ibapi/select
Document Length:        2691 bytes

Concurrency Level:      20
Time taken for tests:   4712.860 seconds
Complete requests:      100000
Failed requests:        1
   (Connect: 0, Receive: 0, Length: 1, Exceptions: 0)
Non-2xx responses:      1
Total transferred:      299097415 bytes
Total body sent:        73300000
HTML transferred:       269097407 bytes
Requests per second:    21.22 [#/sec] (mean)
Time per request:       942.572 [ms] (mean)
Time per request:       47.129 [ms] (mean, across all concurrent requests)
Transfer rate:          61.98 [Kbytes/sec] received
                        15.19 kb/s sent
                        77.17 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       8
Processing:    10  941 159.0    938    3884
Waiting:       10  941 159.0    938    3884
Total:         11  942 159.0    939    3885

Percentage of the requests served within a certain time (ms)
  50%    939
  66%    981
  75%   1009
  80%   1028
  90%   1085
  95%   1145
  98%   1244
  99%   1378
 100%   3885 (longest request)